org/_posts/2017-12-22-scientific-steps.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Steps of scientific inquiry"
date: 2017-12-22
comments: true
archive: true
notes: true
tags: notes
excerpt: Steps of scientific inquiry.
---
#+END_HTML

*Steps of Scientific Inquiry*

1. Ask a question; State the problem to be solved.

2. Do background research; Gather information and investigate known
   facts about the topic.

3. Construct a hypothesis; Based on the research, construct an
   educated guess about the inner workings and what the answer to the
   questions might be.

4. Test with an experiment; Design a test that will either confirm or
   refute the hypothesis.

5. Analyze results and draw conclusions.

*Purpose*

Prove or disprove someone's hypothesis. In other words someone's
prediction is correct or not. Designing the experiment should answer
the following questions:

1. Does the experiment answer the question I'm trying to solve?
2. Does it adequately test my hypothesis?
3. Can I make observations about the results of my experiments.
4. Will I be able to analyze those results
5. If I run this test will it allow me to come up with some kind of
   conclusion.

*What an experiment needs?*

~Rule#1~: The experiment must show that a hypothesis is either
supported or not. Avoid using terms "right" and "wrong" or that the
hypotheses are "proved" or "disproved" until we are really sure about
it. A single experiment is not enough to prove anything with 100\%
certainty.

~Rule#2~: The results must be measurable and objective. Use standard
units to measure different properties. Sometimes need special
equipment to measure things such as ultraviolet light and infrasonic
sounds.

~Rule#3~: Experiment should be repeatable and reproducible.


*Theories and Laws*

~Theory~, is a statement generally accepted as a summary for a
hypothesis or a group of hypothesis. You can also call a theory an
accepted hypothesis. When many have tested the same hypothesis and
come up with the same conclusion then we can call that hypothesis a
theory. A theory can still be disproved.


A ~Law~, is viewed as a universal fact. A scientific law is a general
statement about a group of observations that has no exceptions to the
rule. Most laws can be stated as mathematical equations, e.g. Boyele's
law and Pascal's law. In biology laws are regarded as statements about
how living things work, e.g. Mendel's law{law of segregation, law of
independent assortment}.
