_posts/2017-12-22-scientific-steps.html
---
layout: post
title: "Steps of scientific inquiry"
date: 2017-12-22
comments: true
archive: true
notes: true
tags: notes
excerpt: Steps of scientific inquiry.
---

<p>
<b>Steps of Scientific Inquiry</b>
</p>

<ol class="org-ol">
<li>Ask a question; State the problem to be solved.</li>

<li>Do background research; Gather information and investigate known
facts about the topic.</li>

<li>Construct a hypothesis; Based on the research, construct an
educated guess about the inner workings and what the answer to the
questions might be.</li>

<li>Test with an experiment; Design a test that will either confirm or
refute the hypothesis.</li>

<li>Analyze results and draw conclusions.</li>
</ol>

<p>
<b>Purpose</b>
</p>

<p>
Prove or disprove someone's hypothesis. In other words someone's
prediction is correct or not. Designing the experiment should answer
the following questions:
</p>

<ol class="org-ol">
<li>Does the experiment answer the question I'm trying to solve?</li>
<li>Does it adequately test my hypothesis?</li>
<li>Can I make observations about the results of my experiments.</li>
<li>Will I be able to analyze those results</li>
<li>If I run this test will it allow me to come up with some kind of
conclusion.</li>
</ol>

<p>
<b>What an experiment needs?</b>
</p>

<p>
<code>Rule#1</code>: The experiment must show that a hypothesis is either
supported or not. Avoid using terms "right" and "wrong" or that the
hypotheses are "proved" or "disproved" until we are really sure about
it. A single experiment is not enough to prove anything with 100\%
certainty.
</p>

<p>
<code>Rule#2</code>: The results must be measurable and objective. Use standard
units to measure different properties. Sometimes need special
equipment to measure things such as ultraviolet light and infrasonic
sounds.
</p>

<p>
<code>Rule#3</code>: Experiment should be repeatable and reproducible.
</p>


<p>
<b>Theories and Laws</b>
</p>

<p>
<code>Theory</code>, is a statement generally accepted as a summary for a
hypothesis or a group of hypothesis. You can also call a theory an
accepted hypothesis. When many have tested the same hypothesis and
come up with the same conclusion then we can call that hypothesis a
theory. A theory can still be disproved.
</p>


<p>
A <code>Law</code>, is viewed as a universal fact. A scientific law is a general
statement about a group of observations that has no exceptions to the
rule. Most laws can be stated as mathematical equations, e.g. Boyele's
law and Pascal's law. In biology laws are regarded as statements about
how living things work, e.g. Mendel's law{law of segregation, law of
independent assortment}.
</p>
